# DATA CLEANING AND PREPARATION

# Chapter 7
#### 7.1 : Handling Missing Data
#### 7.2 : Data Transformation
#### 7.3 : String Manipulation

# 7.1 : Handling Missing Data

- Filtering Out Missing Data
> 1. isnull
> 2. notnull
> 3. dropna
- Filling In Missing Data
> 1. fillna

In [1]:
import pandas as pd
import numpy as np

<b>Filtering Out Missing Data</b>

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])

In [3]:
string_data.isnull()

0    False
1    False
2     True
3     True
dtype: bool

In [4]:
string_data[string_data.isnull()]

2     NaN
3    None
dtype: object

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [6]:
string_data.notnull()

0     True
1     True
2    False
3    False
dtype: bool

In [7]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
dtype: object

In [9]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
test=data.dropna()
test

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data.dropna(inplace=True)
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [17]:
data.dropna(axis=0,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

--------------------------

<b>Filling In Missing Data</b>

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.184161 -1.155311 -0.361288
1 -1.725805  0.461587  0.343913
2 -1.493837  0.143487  0.208510
3  1.433887  0.231068  0.920204
4 -1.907924  0.779918 -1.104143
5  0.674515 -0.055365  1.398609
6 -2.169786  1.188294  0.160082

In [20]:
df.iloc[:4, 1] = np.nan

In [21]:
df.iloc[:2, 2] = np.nan

In [22]:
df

          0         1         2
0  0.184161       NaN       NaN
1 -1.725805       NaN       NaN
2 -1.493837       NaN  0.208510
3  1.433887       NaN  0.920204
4 -1.907924  0.779918 -1.104143
5  0.674515 -0.055365  1.398609
6 -2.169786  1.188294  0.160082

In [23]:
df.fillna(0)

          0         1         2
0  0.184161  0.000000  0.000000
1 -1.725805  0.000000  0.000000
2 -1.493837  0.000000  0.208510
3  1.433887  0.000000  0.920204
4 -1.907924  0.779918 -1.104143
5  0.674515 -0.055365  1.398609
6 -2.169786  1.188294  0.160082

In [24]:
df.fillna({1:0.5,2:0.7})

          0         1         2
0  0.184161  0.500000  0.700000
1 -1.725805  0.500000  0.700000
2 -1.493837  0.500000  0.208510
3  1.433887  0.500000  0.920204
4 -1.907924  0.779918 -1.104143
5  0.674515 -0.055365  1.398609
6 -2.169786  1.188294  0.160082

# 
### 7.2 : Data Transformation

- Removing Duplicated
> 1. duplicated
> 2. drop_duplicated
- Transforming Data Using a Function or Mapping
> 1. map
- Replacing Values
> 1. replace
- Renaming Axis Indexes
> 1. rename
- Discretization And Binning
> 1. cut
- Detecting And Filtering Outliers

----------------------------------------------

<b>Removing Duplicated</b>

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 1, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   1
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data[data.duplicated()]

    k1  k2
2  one   1
6  two   4

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
3  two   3
4  one   3
5  two   4

In [29]:
data['k3'] = range(7)

In [30]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  k3
0  one   1   0
1  two   1   1

In [34]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
6  two   4   6

-------------------

<b>Transforming Data Using A Function Or Mapping</b>

In [36]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [37]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [39]:
lowercased = data['food'].str.lower()

In [40]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [41]:
data['animal1'] = lowercased.map(meat_to_animal)

In [42]:
data

          food  ounces animal1
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [43]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()])

In [44]:
data

          food  ounces animal1  animal
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

-------------------------------

<b>Replacing Values</b>

In [45]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [46]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64